# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [4]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [6]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(1, high=30001, size=100, dtype='l'))
print(s1, s2, s3)

0     2
1     4
2     4
3     4
4     3
     ..
95    4
96    2
97    3
98    3
99    1
Length: 100, dtype: int32 0     1
1     3
2     2
3     1
4     3
     ..
95    2
96    3
97    3
98    2
99    3
Length: 100, dtype: int32 0      1827
1     20968
2      1141
3     11164
4     24741
      ...
95     8135
96    22393
97    23070
98    23059
99    23692
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [8]:
house_market = pd.concat([s1, s2, s3], axis=1)
house_market.head()

   0  1      2
0  2  1   1827
1  4  3  20968
2  4  2   1141
3  4  1  11164
4  3  3  24741

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [9]:
house_market.rename(columns= {0:'bedrs', 1:'bathrs', 2:'price_sqr_meter'}, inplace=True)
house_market.head()

   bedrs  bathrs  price_sqr_meter
0      2       1             1827
1      4       3            20968
2      4       2             1141
3      4       1            11164
4      3       3            24741

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [11]:
bigcolumn = pd.concat([s1,s2,s3], axis=0)
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))
bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       2
1       4
2       4
3       4
4       3
..    ...
95   8135
96  22393
97  23070
98  23059
99  23692

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [12]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [13]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        2
1        4
2        4
3        4
4        3
..     ...
295   8135
296  22393
297  23070
298  23059
299  23692

[300 rows x 1 columns]